Proj/app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    @user[:friends]=[]

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("usname", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["usname", "piero"], ["password_digest", "$2a$10$CUFto5p6hPPJ30M7M/HyPuU7asDqz/94hZ5mbkYXQMwXPc7kenm.W"], ["created_at", "2018-05-06 21:22:27.741816"], ["updated_at", "2018-05-06 21:22:27.741816"]]

  def update
    respond_to do |format|
      if @user.update(user_params)
---
UPDATE "users" SET "usname" = $1, "password_digest" = $2, "image" = $3, "updated_at" = $4 WHERE "users"."id" = $5  [["usname", "z"], ["password_digest", "$2a$10$pH5rFWb66uWH9F7nfhC93OKOctfYA2vw8.rgXL/EY52qiWZxEYkSW"], ["image", nil], ["updated_at", "2018-05-09 15:25:13.119155"], ["id", 5]]

  def remove_friend2
    username=params['usname']
    @u=User.find(session[:user_id])
    @arr=@u[:friends]
    @arr.delete(username)
    @u[:friends]= @arr
    @u.save
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "users" SET "friends" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["friends", "{d}"], ["updated_at", "2018-05-23 14:01:02.663796"], ["id", 3]]

  def add_friend
    username=params['usname']
    @u=User.find(session[:user_id])
    @arr=@u[:friends]
    if @arr.include?(username)
    else
      @arr.push(username)
    end
    @u[:friends]= @arr
    @u.save
    redirect_to User.find_by(usname: username)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "friends" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["friends", "{d,c,e}"], ["updated_at", "2018-05-14 19:42:23.534846"], ["id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."usname" = $1 LIMIT $2  [["usname", "e"], ["LIMIT", 1]]

  def search
    username=params['usname']
    @user=User.find_by(usname: username)
---
SELECT  "users".* FROM "users" WHERE "users"."usname" = $1 LIMIT $2  [["usname", "7"], ["LIMIT", 1]]