Proj/app/views/users/show.html.erb

SELECT  "users".* FROM "users" WHERE "users"."usname" = $1 LIMIT $2  [["usname", "d"], ["LIMIT", 1]]
---

    <% if User.find(session[:user_id])!=@user && User.find(session[:user_id])[:teams].include?(@user.usname)%>