app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."usname" = $1 LIMIT $2  [["usname", "piero"], ["LIMIT", 1]]
---
  def create
    oa = request.env["omniauth.auth"]
    if oa != nil
      user = User.from_omniauth(oa)
      session[:user_id] = user.id
      session[:user_usname] = user.usname

      redirect_to user, alert: "User logged in :D"
    else
        user = User.find_by(usname: params[:usname])